{
  "backend/main.mo": "Main backend actor implementing chat rooms, user profiles, gift transactions, message handling, user blocking, and access control with Motoko storage mixins and authorization.",
  "feature_evidence.json": "Feature evidence report documenting implementation of Global ZGEY logo in Layout header and favicon with high confidence and associated test IDs.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components including pages, hooks, and UI elements for the Global ZGEY voice chat application.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark theme color schemes using OKLCH color space.",
  "frontend/index.html": "HTML entry point with Global ZGEY favicon, viewport meta tags, and root div for React mounting.",
  "frontend/src/App.tsx": "Root application component with TanStack Router configuration, Internet Identity authentication flow, profile setup redirect logic, and theme provider wrapper.",
  "frontend/src/components/ChatMessage.tsx": "Chat message component displaying avatar, timestamp, and message content with optional word-by-word translation support.",
  "frontend/src/components/ConversationList.tsx": "Conversation list component showing mock conversations with avatars, last messages, timestamps, unread badges, and navigation to chat pages.",
  "frontend/src/components/CreateRoomModal.tsx": "Modal dialog for creating a new room with form inputs for room name, language selection, topic tags (up to 3), and public/private toggle; navigates to the created room on success.",
  "frontend/src/components/GiftMessage.tsx": "Displays a gift transaction message in a styled card showing sender, recipient, gift icon/image, and timestamp with animated entrance effect.",
  "frontend/src/components/GiftPickerModal.tsx": "Multi-step modal for selecting a recipient and gift from catalog, then confirming and sending the gift in a room; handles image loading errors and principal conversion.",
  "frontend/src/components/HandRaiseQueue.tsx": "Displays a queue of hand-raise requests with approve/deny buttons for each participant, showing avatars with initials.",
  "frontend/src/components/InRoomChat.tsx": "Room chat component that merges and displays messages and gift transactions in chronological order with a message input form and gift picker button.",
  "frontend/src/components/InterestSelector.tsx": "Badge-based selector allowing users to choose up to 10 interests from a predefined list with visual feedback for selection state.",
  "frontend/src/components/InterestTags.tsx": "Simple display component that renders a list of interests as styled badge elements.",
  "frontend/src/components/LanguageFilterTabs.tsx": "Tab navigation component for filtering by language with a decorative background image and gradient overlay.",
  "frontend/src/components/LanguageLevelBadge.tsx": "Badge component displaying a language and proficiency level with different icons and styling for native vs. learning levels.",
  "frontend/src/components/Layout.tsx": "Main application layout component with header navigation, authentication controls, and user profile dropdown menu. Handles login/logout, displays logo, navigation links (Live Lobby, Messages), and user avatar with profile/favorites/logout options.",
  "frontend/src/components/ListenerSection.tsx": "Displays a grid of listener avatars with their names and language levels in a card. Includes a \"Raise Hand\" button for listeners to request speaking privileges.",
  "frontend/src/components/NewConversationModal.tsx": "Modal dialog for creating new private conversations or group chats. Allows users to enter a conversation name and toggle between direct message and group chat modes.",
  "frontend/src/components/ProficiencySelector.tsx": "Component for selecting and managing multiple language proficiency levels with support for Native, JLPT, CEFR, and HSK level systems. Displays selected levels as removable tags and provides dropdowns to add new language/level pairs.",
  "frontend/src/components/PulsingAvatar.tsx": "Avatar component with visual indicators for active speaking state (pulsing ring animation) and microphone mute status. Displays user initials with gradient background.",
  "frontend/src/components/ReportBlockMenu.tsx": "Dropdown menu with options to report or block users, featuring confirmation dialogs for both actions. Report dialog includes predefined categories (Harassment, Spam, Inappropriate Content, Other).",
  "frontend/src/components/RoomCard.tsx": "Clickable card component displaying room information including name, language, topics, active speakers count, and total participants. Shows a \"Hot\" badge for popular rooms and includes hover effects.",
  "frontend/src/components/RoomSettingsModal.tsx": "Modal dialog for room management with a delete room button that shows a confirmation alert dialog. Navigates to home page after successful deletion.",
  "frontend/src/components/RoomSuggestions.tsx": "Displays a card with up to 3 recommended rooms filtered by matching user interests or language proficiency, using RoomCard components in a responsive grid.",
  "frontend/src/components/SpeakerSection.tsx": "Renders a card showing active speakers in a room with their avatars (using PulsingAvatar), names, and language levels in a responsive grid layout.",
  "frontend/src/components/TopicFilterBar.tsx": "Provides a topic filter UI with predefined topics as clickable badges, allowing multi-select filtering with a clear-all option.",
  "frontend/src/components/TranslatableWord.tsx": "Wraps a word in a popover that translates it to the user's primary language on click using the translate API mutation.",
  "frontend/src/components/VideoCallInterface.tsx": "Displays a video call grid with mock participants showing video/audio status, language levels, and integrates with InRoomChat component in a responsive layout.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance with authentication, initializing access control and invalidating dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login state, identity persistence, and AuthClient lifecycle.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend operations including user profiles, rooms, messages, translations, gifts, and admin functions with proper cache invalidation.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with a warm earth-tone color palette (terracotta, coral, sage, peach, beige) for light and dark modes, plus custom animations.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient provider and InternetIdentity provider wrapping the main App component.",
  "frontend/src/pages/ChatConversation.tsx": "Chat conversation page displaying messages for a specific room with real-time scrolling, message sending functionality, and authentication checks.",
  "frontend/src/pages/LiveLobby.tsx": "Main lobby page showing filterable voice chat rooms with language/topic filters, room suggestions, and mock data that updates periodically to simulate live activity.",
  "frontend/src/pages/MessagesPage.tsx": "Messages overview page with search functionality, conversation list, and modal to start new conversations; requires authentication.",
  "frontend/src/pages/ProfileSetup.tsx": "Comprehensive profile creation/editing form with fields for personal info, profile picture upload with progress tracking, language proficiency, interests, and travel preferences.",
  "frontend/src/pages/UserProfile.tsx": "User profile view page displaying detailed user information including avatar, languages, interests, and personal details with edit/report options based on ownership.",
  "frontend/src/pages/VoiceRoom.tsx": "Voice chat room interface with speaker/listener sections, hand-raise queue, in-room chat, video mode toggle, and mock participant data with simulated speaking indicators.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support and methods to clear parameters from URLs.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color schemes using OKLCH color space, extended border radius values, custom fonts (Inter), box shadows, and accordion animations with typography and container query plugins.",
  "project_state.json": "Project state document describing a global multi-language communication app with voice/video/text chat, live lobby with language filters, interactive voice rooms, translation tools, and user profiles; includes architectural notes about WebRTC, translation APIs, and moderation systems."
}