{
  "backend/main.mo": "Main backend actor implementing a social language-learning platform with room management (public/private), messaging, user profiles, gifts, stranger video pairing, access control, and blob storage for profile pictures and gift icons.",
  "feature_evidence.json": "Feature evidence report documenting a request to remove/hide a tip notification element in LiveLobby.tsx, with high confidence and associated test ID REQ-57.",
  "frontend-file-summaries.txt": "Pre-generated summaries of frontend files describing the React application structure including routing, voice/video chat lobbies, stranger video calling, profile management, messaging, and UI components with translation and gift features.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI elements like backgrounds, borders, cards, sidebars, and chart colors using oklch color space.",
  "frontend/index.html": "HTML entry point for the Global ZGEY application with favicon, viewport meta tag, and script reference to the React main.tsx module.",
  "frontend/src/App.tsx": "Root application component with TanStack Router setup, Internet Identity authentication, profile setup redirect logic, theme provider, and routes for voice/video chat lobbies, stranger video, messages, and user profiles.",
  "frontend/src/components/ChatMessage.tsx": "Chat message component displaying avatar, timestamp, and message content with optional word-by-word translation support and different styling for current user vs. other users.",
  "frontend/src/components/ConversationList.tsx": "Conversation list component showing mock conversations with avatars, last messages, timestamps, unread badges, search filtering, and navigation to individual chat pages.",
  "frontend/src/components/CreateRoomModal.tsx": "Modal dialog for creating a new room with form inputs for room name, language selection, topic badges (up to 3), and a private/public toggle switch. Navigates to the created room on success.",
  "frontend/src/components/GiftMessage.tsx": "Displays a gift transaction as an animated card showing sender, recipient, gift icon/image, and timestamp. Fetches user profiles and gift catalog data to render the message.",
  "frontend/src/components/GiftPickerModal.tsx": "Multi-step modal for sending gifts: select recipient from participants, choose a gift from catalog with images, and confirm the transaction. Handles gift sending mutation and image error states.",
  "frontend/src/components/HandRaiseQueue.tsx": "Card component displaying a queue of hand-raise requests with approve/deny buttons for each participant. Shows avatars with initials and request count.",
  "frontend/src/components/InRoomChat.tsx": "Chat interface combining text messages and gift transactions in a unified timeline, sorted by timestamp. Includes message input, send button, and gift picker modal trigger.",
  "frontend/src/components/InterestSelector.tsx": "Multi-select badge interface for choosing up to 10 interests from a predefined list. Displays selected count and disables unselected badges when limit is reached.",
  "frontend/src/components/InterestTags.tsx": "Simple display component that renders an array of interest strings as styled badges with peach-themed colors.",
  "frontend/src/components/LanguageFilterTabs.tsx": "Tabbed language filter with gradient background image overlay. Renders tabs for each language with active state styling in terracotta/coral gradient.",
  "frontend/src/components/LanguageLevelBadge.tsx": "Badge component displaying language and proficiency level with conditional icon (graduation cap for native, book for learner) and color theming.",
  "frontend/src/components/Layout.tsx": "Main application layout component with header navigation, authentication controls, and user profile dropdown. Includes links to live lobby, voice chat, video chat, and stranger video features.",
  "frontend/src/components/ListenerSection.tsx": "Displays a grid of listener avatars with their names and language levels, includes a 'Raise Hand' button for listeners to request speaking privileges.",
  "frontend/src/components/NewConversationModal.tsx": "Modal dialog for creating new private or group conversations with a name input and group toggle switch, navigates to the chat room on success.",
  "frontend/src/components/ProficiencySelector.tsx": "Component for selecting and managing multiple language proficiency levels with support for Native, JLPT, CEFR, and HSK level systems across 10 languages.",
  "frontend/src/components/PulsingAvatar.tsx": "Avatar component with visual indicators for active speaking state (pulsing ring animation) and microphone mute status.",
  "frontend/src/components/ReportBlockMenu.tsx": "Dropdown menu with report and block user actions, includes confirmation dialogs for reporting users by category and blocking users.",
  "frontend/src/components/RoomCard.tsx": "Clickable card displaying room information including name, language, topics, active speakers count, total participants, and a 'Hot' badge for popular rooms.",
  "frontend/src/components/RoomSettingsModal.tsx": "Modal dialog for room management with a delete room action that includes a confirmation alert dialog and navigates away on success.",
  "frontend/src/components/RoomSuggestions.tsx": "Displays a card with up to 3 recommended rooms filtered by user's interests and language proficiency, navigating to room details on click.",
  "frontend/src/components/SpeakerSection.tsx": "Shows a grid of active speakers in a room with their avatars, names, language levels, and speaking/muted status indicators.",
  "frontend/src/components/StrangerWaitingRoom.tsx": "Displays an animated waiting screen with loading indicators while searching for a random stranger to connect with, including a cancel button.",
  "frontend/src/components/TopicFilterBar.tsx": "Provides a filterable list of topic badges (Gaming, Travel, etc.) with toggle selection and clear-all functionality.",
  "frontend/src/components/TranslatableWord.tsx": "Makes individual words clickable to show translations in a popover, automatically translating to the user's primary language on click.",
  "frontend/src/components/VideoCallInterface.tsx": "Renders a video call grid with mock participants showing video feeds, language levels, and audio/video status, plus an expandable chat sidebar.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance with Internet Identity authentication, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login state, identity persistence, and AuthClient lifecycle.",
  "frontend/src/hooks/useQueries.ts": "Exports React Query hooks for all backend operations including user profiles, room messages, room management, translations, and gift transactions.",
  "frontend/src/index.css": "Global CSS file that imports Tailwind directives and defines CSS custom properties for a warm earth-tones color palette (terracotta, coral, sage, peach, beige) with light/dark mode support and custom utility classes.",
  "frontend/src/main.tsx": "Application entry point that renders the root React component with QueryClient and InternetIdentityProvider wrappers for state management and authentication.",
  "frontend/src/pages/ChatConversation.tsx": "Chat conversation page component that displays messages for a specific room, handles sending messages, and auto-scrolls to latest messages. Requires authentication to access.",
  "frontend/src/pages/LiveLobby.tsx": "Main lobby page displaying filterable live chat rooms with language and topic filters, room suggestions, and mock room data that updates periodically to simulate activity.",
  "frontend/src/pages/MessagesPage.tsx": "Messages overview page showing conversation list with search functionality and ability to create new conversations. Requires authentication to access.",
  "frontend/src/pages/ProfileSetup.tsx": "Comprehensive user profile setup form handling personal information, profile picture upload with progress tracking, language proficiency, interests, and travel preferences.",
  "frontend/src/pages/StrangerVideoCall.tsx": "Stranger video call page that manages matching state (idle/searching/matched), polls for stranger pairing, and displays video call interface with chat when matched.",
  "frontend/src/pages/UserProfile.tsx": "Displays a user profile page with avatar, bio, languages, interests, and location details. Supports viewing own profile with edit option or other users' profiles with report/block menu.",
  "frontend/src/pages/VideoChatLobby.tsx": "Video chat lobby page showing filterable list of video rooms by language and topics. Includes mock room data with dynamic participant counts and hot room badges, plus room creation functionality.",
  "frontend/src/pages/VoiceChatLobby.tsx": "Voice chat lobby page displaying filterable voice rooms with language and topic filters. Features mock room data with auto-updating speaker counts and room creation modal.",
  "frontend/src/pages/VoiceRoom.tsx": "Voice room interface with speaker/listener sections, in-room chat, hand-raise queue, and video mode toggle. Manages participant states, host controls, and real-time speaking indicators.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting and persisting URL parameters from both regular query strings and hash-based routing. Includes sessionStorage integration for parameter persistence across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color palette (terracotta, coral, sage, peach, beige), extended border radius variables, custom animations, and typography/container-queries plugins.",
  "project_state.json": "Project state file defining a global communication app with voice/video/text chat, multi-language support, live lobby with filters, interactive voice rooms, translation tools, and user profiles. Contains 19 existing features including live lobby discovery, topic tags, hot indicator algorithm, voice room interfaces, raise hand functionality, AI transcription, translation, stranger matching, and user profile management."
}