{
  "backend/main.mo": "Main Motoko actor implementing chat rooms (public/private), user profiles with detailed fields, message sending/retrieval, user blocking, translation via HTTP outcalls, and role-based access control using mixins for storage and authorization.",
  "feature_evidence.json": "Feature evidence report documenting four implemented features related to persistent text chat overlays during voice/video calls in the VoiceRoom and InRoomChat components with high confidence test mappings.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend TypeScript/React components including pages (LiveLobby, VoiceRoom, ProfileSetup, etc.), hooks (useQueries for backend operations), and UI components (chat, avatars, filters, translation) with their key functionalities.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables defining light and dark theme color schemes using oklch color space for backgrounds, foregrounds, borders, and component-specific colors.",
  "frontend/index.html": "HTML entry point for the Global Connect application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with routes for lobby, voice rooms, messages, chat, profiles, and setup; handles authentication state, profile initialization checks, and redirects unauthenticated users to profile setup.",
  "frontend/src/components/ChatMessage.tsx": "Chat message component displaying avatar, timestamp, and message content with optional word-by-word translation support using TranslatableWord component, styled differently for current user vs others.",
  "frontend/src/components/ConversationList.tsx": "Displays filterable list of mock conversations with avatars, last message preview, timestamps, unread badges, and navigation to individual chat pages on click.",
  "frontend/src/components/CreateRoomModal.tsx": "Modal dialog for creating new public or private rooms with fields for room name, language selection, topic tags (up to 3), and privacy toggle. Navigates to the created room on success.",
  "frontend/src/components/HandRaiseQueue.tsx": "Displays a queue of hand-raise requests with user avatars and approve/deny action buttons for room moderators.",
  "frontend/src/components/InRoomChat.tsx": "Real-time chat component for rooms with scrollable message history, message sending form, and translation support. Auto-scrolls to newest messages.",
  "frontend/src/components/InterestSelector.tsx": "Multi-select badge interface for choosing up to 10 interests from a predefined list including gaming, travel, food, and hobbies.",
  "frontend/src/components/InterestTags.tsx": "Simple display component that renders a list of interest strings as styled badge elements.",
  "frontend/src/components/LanguageFilterTabs.tsx": "Tabbed language filter with background image overlay, allowing users to switch between different language options.",
  "frontend/src/components/LanguageLevelBadge.tsx": "Badge component displaying a language and proficiency level with different icons for native vs. learning speakers.",
  "frontend/src/components/Layout.tsx": "Main application layout with header navigation, Internet Identity authentication, user profile dropdown, and responsive navigation links for Live Lobby and Messages.",
  "frontend/src/components/ListenerSection.tsx": "Displays grid of listener avatars in a room with a 'Raise Hand' button for listeners to request speaking privileges.",
  "frontend/src/components/NewConversationModal.tsx": "Modal for creating new private conversations or group chats with name input and group toggle, navigating to the chat on creation.",
  "frontend/src/components/ProficiencySelector.tsx": "A component for selecting and managing multiple language proficiency levels with support for Native, JLPT, CEFR, and HSK level systems. Displays selected languages as removable badges and provides dropdowns to add new language-level pairs.",
  "frontend/src/components/PulsingAvatar.tsx": "Displays a user avatar with initials that pulses and glows when the user is actively speaking. Shows a microphone icon indicator for muted/unmuted status.",
  "frontend/src/components/ReportBlockMenu.tsx": "A dropdown menu component that allows users to report or block other users with confirmation dialogs. Supports multiple report categories (Harassment, Spam, Inappropriate Content, Other) and uses the useBlockUser mutation hook.",
  "frontend/src/components/RoomCard.tsx": "A clickable card component displaying room information including name, language, topics, active speakers count, and total participants. Shows a \"Hot\" badge for popular rooms and has hover effects.",
  "frontend/src/components/RoomSettingsModal.tsx": "A modal dialog for room settings that currently provides a delete room action with confirmation. Uses the useDeleteRoom mutation and navigates to home after successful deletion.",
  "frontend/src/components/RoomSuggestions.tsx": "Displays up to 3 recommended rooms for a user based on matching interests and language proficiency. Renders a special styled card with RoomCard components for each suggestion.",
  "frontend/src/components/SpeakerSection.tsx": "Displays a grid of current speakers in a room using PulsingAvatar components. Shows each speaker's name and language level in a responsive grid layout.",
  "frontend/src/components/TopicFilterBar.tsx": "A filter bar with clickable topic badges (Gaming, Travel, Skincare, etc.) that allows multi-select filtering. Includes a clear all button and highlights selected topics with gradient styling.",
  "frontend/src/components/TranslatableWord.tsx": "Makes individual words clickable to show translations in a popover using the useTranslateText mutation. Automatically translates to the user's primary language when clicked.",
  "frontend/src/components/VideoCallInterface.tsx": "React component that displays a video call interface with a grid of mock participants showing video feeds, language levels, and audio/video status indicators. Includes controls for toggling chat and displays participant badges with mute/video status.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that manages the backend actor instance using React Query, creating authenticated or anonymous actors based on Internet Identity state. Invalidates and refetches dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login/logout state, identity persistence, and AuthClient lifecycle. Provides authentication status, identity object, and login/clear functions to child components.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for backend operations including user profiles, room messages, room creation/deletion, and message sending. Each hook uses the actor from useActor and handles loading states, caching, and toast notifications.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom color palette based on warm earth tones (terracotta, coral, sage, peach, beige) and CSS variables for light/dark themes. Includes utility classes for custom colors and pulse animation keyframes.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClientProvider for React Query and InternetIdentityProvider for authentication context. Renders the main App component with necessary providers.",
  "frontend/src/pages/ChatConversation.tsx": "Chat conversation page component that displays messages for a specific room with auto-scrolling, message input, and send functionality. Requires authentication and fetches/displays messages using room ID from URL params.",
  "frontend/src/pages/LiveLobby.tsx": "Main lobby page displaying live voice chat rooms with filtering by language and topics, room creation modal, and room suggestions. Uses mock data for rooms with periodic updates to simulate activity.",
  "frontend/src/pages/MessagesPage.tsx": "Messages page showing conversation list with search functionality and new conversation creation. Requires authentication and redirects unauthenticated users to the live lobby.",
  "frontend/src/pages/ProfileSetup.tsx": "Profile setup/edit form collecting user information including basic details, profile picture upload with progress tracking, language proficiency levels, interests, and personal details. Handles image validation and ExternalBlob upload.",
  "frontend/src/pages/UserProfile.tsx": "User profile view page displaying detailed profile information including avatar, languages, interests, and personal details. Supports viewing own profile with edit option or other users' profiles with report/block functionality.",
  "frontend/src/pages/VoiceRoom.tsx": "Voice chat room interface with speaker/listener sections, hand-raise queue, in-room chat, and optional video mode. Uses mock participants and simulates speaking activity with periodic updates.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support for maintaining state across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file defining custom color schemes using OKLCH color space, extended border radius utilities, custom fonts (Inter), animations for accordions, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state document describing a global communication app with voice/video/text chat, multi-language support, live lobby with filters, interactive voice rooms, translation tools, and user profiles; includes architectural notes about WebRTC, translation APIs, real-time database needs, and existing feature implementations."
}